[
  {
    "id": 6,
    "active": true,
    "title": "Static Company Website",
    "description": [
      "Developed a fully static company website using React and Next.js for high performance and SEO optimization.",
      "Designed a clean and professional layout to effectively showcase company services and team profiles.",
      "Implemented responsive design using Tailwind CSS to ensure compatibility across all devices.",
      "Integrated static content management using Markdown for easy updates by non-technical team members.",
      "Deployed the site on Vercel for seamless hosting and fast load times.",
      "Enhanced site accessibility by adhering to WCAG standards for inclusive user experience."
    ],
    "path": "https://zetta-stackpvt.vercel.app/?vercelToolbarCode=TBtdT1EE3gD_D0n",
    "openExternal": true,
    "image": "/images/companySiteImage.png"
  },
  {
    "id": 88,
    "active": true,
    "title": "Jira Clone",
    "description": [
      "Developed a comprehensive component library using Next.js, Hono.js, Zod, and ShadCN UI.Integrated essential components including buttons, modals, and dropdowns to ensure a cohesive UI experience.Streamlined the library for seamless integration across various sections of the Jira clone project.Privately deployed the package to facilitate team collaboration within the project.Accelerated development cycles by leveraging reusable components across different features and functionalities."
    ],
    "path": "https://jira-clone-two-sigma.vercel.app/",
    "componentType": "PackageComponents",
    "openExternal": true
  },
  {
    "id": 2,
    "active": true,
    "title": "Portfolio Website",
    "description": [
      "Built a personal portfolio website to showcase projects and skills.",
      "Utilized Tailwind CSS for modern design and responsiveness.",
      "Deployed on Vercel with custom domain integration."
    ],
    "image": "/images/PorfolioImage.png",
    "path": "https://my-portfolio-mu-one-77.vercel.app/",
    "openExternal": true
  },

  {
    "id": 3,
    "active": false,
    "title": "Expense Tracker Mobile App",
    "description": [
      "Developed a cross-platform mobile app for tracking daily expenses using React Native. Implemented a user-friendly interface with NativeWind for styling components. Utilized Zustand for efficient state management, enabling seamless handling of application state. Added features for category-based expense tracking and visual analytics using charts."
    ],
    "path": "/projects/Mobile",
    "componentType": "Mobile",
    "screens": [
      {
        "name": "Landing Screen",
        "image": "/images/LandingScreen.png"
      },
      {
        "name": "Dashboard Screen",
        "image": "/images/DashboardScreen.png"
      },
      {
        "name": "Category Screen",
        "image": "/images/CategoryScreen.png"
      },
      {
        "name": "Reminder Screen",
        "image": "/images/ReminderScreen.png"
      },
      {
        "name": "Account Screen",
        "image": "/images/AccountScreen.png"
      },
      {
        "name": "Budget Screen",
        "image": "/images/BudgetScreen.png"
      },
      {
        "name": "NewCreate Screen",
        "image": "/images/NewCreateScreen.png"
      },
      {
        "name": "Profile Screen",
        "image": "/images/ProfileScreen.png"
      }
    ]
  },
  {
    "id": 5,
    "active": false,
    "title": "Reusable Components Library",
    "description": [
      "Created a reusable component library using React and `simple-react-components` npm package.",
      "Implemented components such as buttons, modals, and dropdowns for consistent UI design.",
      "Optimized the library for easy integration across multiple projects.",
      "Published the package privately for use in team projects.",
      "Improved development speed by reusing pre-built components across applications."
    ],
    "path": "/projects/Reusable_Components_Library",
    "componentType": "PackageComponents"
  }
]
